CFD_results/medium_for_validation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
47150
(
(0.0375603612841562 0.0118446292194653 0.632119772495421)
(0.0265836025268677 -0.0339475908896462 0.625976681124667)
(-0.000788333444233097 0.00919851573866004 0.638134421184555)
(0.00421596659664654 -0.00369949918443493 0.651936742963399)
(0.00448519587290886 -0.0118869681725555 0.643238967115067)
(-0.000925266583321841 -0.00848034837079669 0.644725388196421)
(0.000614879612752262 -0.00283258664095692 0.641860518694224)
(0.000803809122280242 -0.00100778333696259 0.641315287129617)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 1.788e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
140
(
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
(-0 -0 0.636704432934213)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
286
(
(0.159916921319647 -0.0779220275313919 -0.413134343991478)
(0.156082746269266 -0.0887911115810895 -0.427193583533366)
(0.175808595916746 -0.0736504505124946 -0.403193576504831)
(0.170910868631424 -0.0820718490434736 -0.402623528873978)
(0.147953990429624 -0.0260151089936881 -0.387949220222924)
(0.131561367650386 -0.0441097644254991 -0.374359368143761)
(0.16581667606134 -0.0590692012770706 -0.343715202049761)
(0.133102040875325 -0.0442572393443394 -0.379833894994993)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
