CFD_results/medium_for_validation/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
133753
(
8.15580109609038e-08
-9.33275100602767e-09
-4.02719392755195e-09
-7.45450771201398e-08
1.13543337868056e-08
-5.00730149307696e-09
-5.62011432838365e-08
-7.21436691827121e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
-3.71731211844467e-08
-4.5394112600076e-08
-4.59682914778336e-08
-3.72294583185551e-08
-1.2060814412309e-07
-1.38525407938049e-07
-5.04724576864763e-08
-5.037893806258e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
286
(
3.6406516226384e-08
3.85824322333459e-08
3.40311133394888e-08
3.40040044238597e-08
2.07548777060267e-08
2.51446915291418e-08
7.40775610881474e-08
2.28215764116954e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
